content/about/_index.md
+++
title = "About"
author = ["Diego Zamboni"]
date = 2018-03-22T19:40:00+01:00
aliases = ["/about.html"]
draft = false
creator = "Emacs 26.1 (Org mode 9.1.11 + ox-hugo)"
weight = 6
featured_image = "/images/legoland.jpg"
+++

**Who:** I am a computer scientist, consultant, programmer, sysadmin, author and overall geek, now turned project leader and engineering team manager. I am from Mexico but live in Switzerland with my awesome wife and our two beautiful daughters.

**What:** I work as the lead of a development team in the Cloud Platform Division of [Swisscom](http://swisscom.com/), where I am applying my experience and background in security, configuration management, cloud computing and automation to build the next-generation cloud infrastructure for Swisscom and its customers. I am also the author of ["Learning CFEngine 3"](http://cf-learn.info).

**Where:** I was born in Argentina, but have moved around all my life.  When I was very young I moved to Mexico, where I lived in four different cities before moving to the U.S. to pursue my Ph.D. at [Purdue University](http://www.cerias.purdue.edu/) under the direction of [Gene Spafford](http://spaf.cerias.purdue.edu/). Upon finishing my studies, my wife and I decided to go to Switzerland, where I worked at the [IBM Zurich Research Lab](http://www.zurich.ibm.com/). Eight years and two kids later, we [moved to Mexico](/brt/2009/09/08/going-home/index.html) in late 2009. In 2015, we moved back to Switzerland.

**Long version:** If you are interested, here's my [curriculum vitae](/vita.html). For other useless trivia about me, see [here](http://www.zzamboni.org/brt/2007/03/07/blog-tagged/index.html).

**My online past:**

-   2009-2016: All old blog entries have been incorporated onto [this blog](/post);
-   2005-2009: My blog titled [BrT](/brt) (static archive copy);
-   1997-2001: My [web page at Purdue University](http://homes.cerias.purdue.edu/~zamboni/).


## About this site {#about-this-site}

This entire site is generated by [Hugo](http://gohugo.io) and served by [GitHub](http://github.com/) through the incredibly useful [GitHub Pages](http://pages.github.com/) feature.

Both the source and the generated website are stored in the [zzamboni/zzamboni.org](https://github.com/zzamboni/zzamboni.org) GitHub repository, which is devoted to this content.  Recently I started using [ox-hugo](https://ox-hugo.scripter.co/) to generate the content from [a single source file](https://github.com/zzamboni/zzamboni.org/blob/master/content-org/zzamboni.org) in [org-mode](https://orgmode.org/) format, although all the older articles and pages are still stored in their original source Markdown files (I gradually convert them whenever I update them). Some of my [project](/code) pages are stored in the `gh-pages` branch of their own github repositories. Since GitHub Pages supports custom domains, all of them can be transparently hosted under the zzamboni.org domain.

I think it's incredible that all of this infrastructure is so easy to use and available for free.


## Image attributions: {#image-attributions}

-   C128 Code (code header background) is from the source code listing from my Commodore 128 program [Supercataloguer 128](http://zzamboni.org/brt/2008/01/24/supercataloger-128).
-   [Scrabble letters](https://www.pexels.com/photo/alphabet-board-game-bundle-close-up-278888/) ([blog](../post) header background) from [Pexels](https://www.pexels.com/), licensed under [CC0](https://www.pexels.com/photo-license/).
-   All other header background photos were taken either by my wife or me.

If you have any concerns or questions about the images used in this site, please [let me know](../contact).
